recipes/mapo-tofu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mapo tofu</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Mapo tofu</h1>
<p>
<a href="https://madewithlau.com/recipes/mapo-tofu-chicken">Original link</a>
</p>

<div id="outline-container-org91afc1c" class="outline-2">
<h2 id="org91afc1c">Ingredients</h2>
<div class="outline-text-2" id="text-org91afc1c">
<ul class="org-ul">
<li>500g tofu (any level of firmness is fine)</li>
<li>1 tbsp bean sauce</li>
<li>1 tbsp oyster sauce</li>
<li>1/2 tsp dark soy sauce</li>
<li>2 chili peppers (chili sauce also works as a substitute)</li>
<li>2 garlic cloves</li>
<li>1 green onion (for garnish)</li>
<li>1 cup water</li>
<li>1 tbsp oil</li>
<li>1/2 tsp salt</li>
</ul>
</div>
<div id="outline-container-org8af992c" class="outline-3">
<h3 id="org8af992c">Texture</h3>
<div class="outline-text-3" id="text-org8af992c">
<ul class="org-ul">
<li>1 tsp sesame oil</li>
<li>1 tbsp cornstarch</li>
<li>2 tbsp water</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org83e968c" class="outline-2">
<h2 id="org83e968c">Instructions</h2>
<div class="outline-text-2" id="text-org83e968c">
<ol class="org-ol">
<li>Pour the water out of the tofu package, and chop the tofu into cubes.</li>
<li>Chop garlic, chilies, and green onion</li>
<li>In a bowl, mix together cornstarch (1 tbsp) and water (2 tbsp) until you have an even consistency.</li>
<li>Set your stove to its highest setting, and wait a few minutes for your pan or wok to heat up. Once it's hot enough, add oil (1 tbsp), garlic cloves (2), and chilies (2). Stir the garlic and chilies around for 20 to 30 seconds.</li>
<li>Add bean sauce (1 tbsp) to the wok, stirring it around with the chicken for about 1 minute. Then, add water (1 cup), sugar, salt (1/2 tsp), oyster sauce (1 tbsp), and dark soy sauce (1/2 tsp). Stir around for a few seconds.</li>
<li>Add the tofu to the wok, gently stir it around, and cover the wok with a lid. Let it sit for about 3 minutes, when the wok starts to boil.</li>
<li>Slowly pour the cornstarch mix into the wok, gently stirring the wok around as you go. Be careful not to break the tofu in the process. Next, add sesame oil (1 tsp). Gently stir the wok around to mix the sesame oil in.</li>
<li>Plate the dish.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
